search.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:ns0="urn:schemas-upnp-org:service:ContentDirectory:1" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
            xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <ns0:Search>
            <Filter>*</Filter>
            <ContainerID>*</ContainerID>
            <SearchCriteria></SearchCriteria>
            <StartingIndex>0</StartingIndex>
            <RequestedCount>0</RequestedCount>
            <SortCriteria/>
        </ns0:Search>
    </s:Body>
</s:Envelope>
